{
    "sidebar": {
        "overview": "Обзор",
        "gettingStarted": "Начало работы",
        "components": "Компоненты",
        "support": "Помощь",
        "settings": "Настройки",
        "componentsItems": {
            "formatting": {
                "title": "Форматирование",
                "children": {
                    "textfield": "Textfield"
                }
            }
        }
    },
    "components": {
        "title": "Компоненты",
        "documentation": "Документация",
        "api": "API",
        "children": {
            "textfield": {
                "documentation": {
                    "title": "Textfield",
                    "description": "Это настраиваемое текстовое поле с поддержкой конфигураций стилей, меток и действий. Компонент предоставляет гибкость в изменении размеров, стилей, управления вводом данных и отображения информации.",
                    "basic": {
                        "title": "Базовый",
                        "description": "Базовая конфигурация демонстрирует наиболее простое использование компонента текстового поля. Он только привязывает значение и предлагает минимальные настройки для обработки пользовательского ввода без дополнительной настройки или расширенной функциональности."
                    },
                    "advanced": {
                        "title": "Продвинутый",
                        "description": "Расширенная конфигурация демонстрирует более универсальное использование компонента текстового поля. Эта настройка включает дополнительные свойства, такие как пользовательский идентификатор, имя, метка, заполнитель и вспомогательный текст, что обеспечивает больший контроль над внешним видом и функциональностью компонента."
                    },
                    "invalid": {
                        "title": "Недопустимый",
                        "description": "Недопустимая конфигурация демонстрирует, что компонент текстового поля находится в состоянии ошибки. Оно может включать вспомогательное сообщение, информирующее пользователей о требованиях к вводу, а поле визуально помечается как недействительное, что помогает пользователю исправить введенные данные."
                    },
                    "disabled": {
                        "title": "Недоступный",
                        "description": "Конфигурация «Отключено» иллюстрирует компонент текстового поля в нередактируемом состоянии. Он не позволяет пользователю взаимодействовать с полем, но при этом отображает его текущее значение или заполнитель, что делает его полезным для представлений только для чтения или временного отключения ввода."
                    }
                },
                "api": {

                }
            }
        }
    }
}